Burning-Airlines-Server/app/controllers/airplanes_controller.rb

INSERT INTO "airplanes" ("name", "rows", "column", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "747"], ["rows", 20], ["column", "20"], ["created_at", "2018-02-06 03:46:25.121270"], ["updated_at", "2018-02-06 03:46:25.121270"]]
---
  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_airplane
      @airplane = Airplane.find(params[:id])