Burning-Airlines-Server/app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."destination" = ?  [["destination", "Melbourne"]]
---
  def search
    # @flights = Flight.where destination: params[:content]
    puts params
    puts "GOT PARAMS VAL: #{params[:content]}"

    # Get the destination from params
    destination = params[:content]
    # Filter everything out based on destination

    filtered_flights = Flight.all.where(:destination=>"Melbourne")

INSERT INTO "flights" ("destination", "created_at", "updated_at") VALUES (?, ?, ?)  [["destination", "aaa"], ["created_at", "2018-02-07 00:51:53.400647"], ["updated_at", "2018-02-07 00:51:53.400647"]]
---
  def create
    @flight = Flight.new #(flight_params)

    respond_to do |format|
      if @flight.save